Revit 2027 API
UnitUtils.GetValidUnits Method
 Gets the identifiers of all valid units for a given measurable spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetValidUnits(
	ForgeTypeId specTypeId
)
Public Shared Function GetValidUnits (
	specTypeId As ForgeTypeId
) As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetValidUnits(
	ForgeTypeId^ specTypeId
)
static member GetValidUnits :
        specTypeId : ForgeTypeId -> IList<ForgeTypeId>
Parameters
specTypeId ForgeTypeId
 Identifier of the measurable spec.
Return Value
IList<ForgeTypeId>
 Identifiers of the valid units.
Exceptions
Exception | Condition
ArgumentException |  specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace